Revit 2024 API
BuiltInFailures.MEPCalculationFailures.ExtraPumpSet Property
 More than one parallel pump set defined for the same loop. Verify the flow distribution and delete the extra set, if desired.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ExtraPumpSet { get; }
Visual Basic
Public Shared ReadOnly Property ExtraPumpSet As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ExtraPumpSet {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.MEPCalculationFailures Class
Autodesk.Revit.DB Namespace